# -*- ii: y; -*-
#+TITLE: xip.io config

* Docker run cloud-native k8s dev env
** Environment for docker-init

Customize with your own email and repos (usually forks) to check out.

   #+name: cncf-conformance.env
   #+begin_src shell :tangle cncf-conformance.env
     # Pin your image
     # KUBEMACS_IMAGE=kubemacs/kubemacs:2020.02.19
     # Or not
     KUBEMACS_IMAGE=kubemacs/kubemacs:latest
     # $(id -u) / mainly for ~/.kube/config permissions
     HOST_UID="1001"
     # Vars for git commits
     KUBEMACS_GIT_EMAIL=hh@ii.coop
     KUBEMACS_GIT_NAME="Hippie Hacker"
     KUBEMACS_TIMEZONE=Pacific/Auckland
     # This is the kind cluster name, maybe we should rename
     # for some reason we can't used kind as the name
     KUBEMACS_KIND_NAME=cncf.conformance
     # ~/.kube/$KUBEMACS_HOSTCONFIG_NAME
     KUBEMACS_HOST_KUBECONFIG_NAME=config
     # Using a docker registry alongside kind
     KIND_LOCAL_REGISTRY_ENABLE=true
     KIND_LOCAL_REGISTRY_NAME=local-registry
     KIND_LOCAL_REGISTRY_PORT=5000
     # The repositories to check out
     KUBEMACS_INIT_DEFAULT_REPOS='https://github.com/hh/kubemacs.git https://github.com/hh/apisnoop.git https://github.com/ii/kubernetes.git'
     # The folder to start tmate/emacs in
     KUBEMACS_INIT_DEFAULT_DIR=apisnoop/deployment/k8s/xip.io
     # The first file you want emacs to open
     KUBEMACS_INIT_ORG_FILE=apisnoop/deployment/k8s/xip.io/README.org:44
     # If you want to see lots of information
     KUBEMACS_INIT_DEBUG=true
   #+end_src

** Running Docker
   #+name: cncf-conformance.sh
   #+begin_src shell :tangle cncf-conformance.sh
     ENV_FILE=cncf-conformance.env
     . $ENV_FILE
     docker run \
            --env-file $ENV_FILE \
            --name kubemacs-docker-init \
            --user root \
            --privileged \
            --network host \
            --rm \
            -it \
            -v "$HOME/.kube:/tmp/.kube" \
            -v /var/run/docker.sock:/var/run/docker.sock \
            $KUBEMACS_IMAGE \
            docker-init.sh
   #+end_src

* Change IP to match current

You might need to setup inbound routing, or it may just work for your IP

  #+begin_src shell
    IP=$(curl ifconfig.co)
    sed -i s:147.75.111.121:$IP:g *yaml
    # sed -i s:$IP:192.168.1.19:g *yaml
    echo http://tilt.$IP.xip.io
    # echo http://tilt.192.168.1.19.xip.io
  #+end_src

  #+RESULTS:
  #+begin_example
  http://tilt.103.26.16.167.xip.io
  #+end_example

* Bring up tilt
#+begin_src tmate :dir "."
  tilt up --host 0.0.0.0
#+end_src
